export const initChat = {
  content: '',
  type: 'send',
  checked: false
}
export const chatMock = {
  "answer": "2023年12月，存储企业海外分重点国的收入和同比，结果如下： ",
  "chartAnswer": [
      "2023年12月，存储企业海外分重点国的收入和同比，结果如下：",
      " "
  ],
  "chartData": [
    "{\"columns\":[\"重点国\",\"2022年12月\",\"2023年12月\",\"同比增长(%)\"],\"rows\":[[\"香港\",\"42.1\",\"57.4\",\"36.3%\"],[\"德国\",\"40.5\",\"46.4\",\"14.7%\"],[\"土耳其\",\"21.3\",\"43.0\",\"101.8%\"],[\"新加坡\",\"30.0\",\"40.0\",\"33.5%\"],[\"巴西\",\"26.8\",\"38.3\",\"42.5%\"],[\"南非\",\"31.8\",\"35.6\",\"11.8%\"],[\"法国\",\"23.5\",\"27.7\",\"17.9%\"],[\"西班牙\",\"11.6\",\"24.4\",\"109.8%\"],[\"尼日利亚\",\"10.1\",\"24.0\",\"137.3%\"],[\"意大利\",\"8.4\",\"22.6\",\"169.5%\"],[\"沙特\",\"20.5\",\"22.3\",\"8.5%\"],[\"阿联酋\",\"14.6\",\"20.6\",\"41.3%\"],[\"墨西哥\",\"13.5\",\"19.8\",\"45.9%\"],[\"印度尼西亚\",\"8.2\",\"16.3\",\"99.1%\"],[\"北欧\",\"6.5\",\"13.0\",\"101.2%\"],[\"瑞士\",\"12.9\",\"12.7\",\"-1.7%\"],[\"西欧多国管理部\",\"9.6\",\"12.4\",\"29.4%\"],[\"菲律宾\",\"3.9\",\"10.5\",\"169.7%\"],[\"马来西亚\",\"4.6\",\"7.5\",\"63.1%\"],[\"泰国\",\"5.5\",\"7.1\",\"29.2%\"],[\"韩国\",\"10.4\",\"6.8\",\"-34.3%\"],[\"日本\",\"4.7\",\"3.3\",\"-28.8%\"],[\"汇总\",\"361.0\",\"511.6\",\"41.7%\"]]}",
    "{\"bar\":[{\"data\":[\"42.1\",\"40.5\",\"21.3\",\"30.0\",\"26.8\",\"31.8\",\"23.5\",\"11.6\",\"10.1\",\"8.4\",\"20.5\",\"14.6\",\"13.5\",\"8.2\",\"6.5\",\"12.9\",\"9.6\",\"3.9\",\"4.6\",\"5.5\",\"10.4\",\"4.7\",\"361.0\"],\"title\":\"2022年12月\"},{\"data\":[\"57.4\",\"46.4\",\"43.0\",\"40.0\",\"38.3\",\"35.6\",\"27.7\",\"24.4\",\"24.0\",\"22.6\",\"22.3\",\"20.6\",\"19.8\",\"16.3\",\"13.0\",\"12.7\",\"12.4\",\"10.5\",\"7.5\",\"7.1\",\"6.8\",\"3.3\",\"511.6\"],\"title\":\"2023年12月\"}],\"line\":[{\"data\":[\"36.3%\",\"14.7%\",\"101.8%\",\"33.5%\",\"42.5%\",\"11.8%\",\"17.9%\",\"109.8%\",\"137.3%\",\"169.5%\",\"8.5%\",\"41.3%\",\"45.9%\",\"99.1%\",\"101.2%\",\"-1.7%\",\"29.4%\",\"169.7%\",\"63.1%\",\"29.2%\",\"-34.3%\",\"-28.8%\",\"41.7%\"],\"title\":\"同比增长(%)\"}],\"labels\":[\"香港\",\"德国\",\"土耳其\",\"新加坡\",\"巴西\",\"南非\",\"法国\",\"西班牙\",\"尼日利亚\",\"意大利\",\"沙特\",\"阿联酋\",\"墨西哥\",\"印度尼西亚\",\"北欧\",\"瑞士\",\"西欧多国管理部\",\"菲律宾\",\"马来西亚\",\"泰国\",\"韩国\",\"日本\",\"汇总\"]}"
  ],
  "chartTitle": [
    "口径：经营双算，单位：M$，指标：净销售收入",
    "口径：经营双算，单位：M$，指标：净销售收入"
  ],
  "chartType": [
    "TABLE",
    "MIX_LINE_BAR"
  ]
}
export const chatMock3 = {
  "aipp_instance_id": "c8a9e655cfbb47c0aa6925b498078a1c",
  "tenant_id": "727d7157b3d24209aefd59eb7d1c49ff",
  "aipp_instance_name": "无标题",
  "status": "ARCHIVED",
  "form_metadata": null,
  "form_args": {
      "finish_at": "2024-05-13 10:00:50.261",
      "created_at": "2024-05-13 10:00:29.458",
      "curr_form_data": "",
      "curr_form_version": "",
      "create_by": "冯勤 WX1112091",
      "flow_trans_id": "2b9ec9d12a774660a09e428d46d1ef89",
      "inst_status": "ARCHIVED",
      "curr_node_id": "",
      "agentResult": "",
      "modified_by": "冯勤 WX1112091",
      "aipp_instance_name": "无标题",
      "progress": "0",
      "curr_form_id": "",
      "modified_at": ""
  },
  "start_time": "2024-05-13 10:00:29.458",
  "end_time": "2024-05-13 10:00:50.261",
  "instance_log": [
      {
          "logId": 15758,
          "aippId": "dd89a95315b646afac7420799a5b15d2",
          "version": "1.0.0-cfd919",
          "aippType": "PREVIEW",
          "instanceId": "c8a9e655cfbb47c0aa6925b498078a1c",
          "logData": "{\"msg\": \"大熊猫的说明文档\", \"form_id\": null, \"form_args\": null, \"form_version\": null}",
          "logType": "QUESTION",
          "createAt": "2024-05-13 10:00:29",
          "createUserAccount": "fWX1112091",
          "path": "/c8a9e655cfbb47c0aa6925b498078a1c",
          "reserve": null
      },
      {
        "logId": 16302,
        "aippId": "1a3fe2f2ed1648999a0bbb1d237c0feb",
        "version": "1.0.0-6da0b6",
        "aippType": "PREVIEW",
        "instanceId": "c1f43c8388404e98bb5312a36233516f",
        "logData": "{\"msg\": \"{\\\"chartType\\\":[\\\"TABLE\\\"],\\\"chartData\\\":[\\\"{\\\\\\\"columns\\\\\\\":[\\\\\\\"2022年1-1月\\\\\\\",\\\\\\\"2023年1-1月\\\\\\\",\\\\\\\"同比增长(%)\\\\\\\"],\\\\\\\"rows\\\\\\\":[[\\\\\\\"13.7\\\\\\\",\\\\\\\"36.6\\\\\\\",\\\\\\\"166.3%\\\\\\\"]]}\\\"],\\\"chartTitle\\\":[\\\"口径：经营双算，单位：M￥，指标：净销售收入\\\"],\\\"chartAnswer\\\":[\\\"2023年1月存储企业国内金融行业收入是多少？\\\\r\\\\n\\\\r结果如下：\\\"],\\\"answer\\\":\\\"2023年1月存储企业国内金融行业收入是多少？\\\\r\\\\n\\\\r结果如下：\\\"}\", \"form_id\": null, \"form_args\": null, \"form_version\": null}",
        "logType": "MSG",
        "createAt": "2024-05-14 17:18:46",
        "createUserAccount": "h00804153",
        "path": "/c1f43c8388404e98bb5312a36233516f",
        "reserve": null
    }
  ]
}
export const codeMock = {
  "aipp_instance_id": "c8a9e655cfbb47c0aa6925b498078a1c",
  "tenant_id": "727d7157b3d24209aefd59eb7d1c49ff",
  "aipp_instance_name": "无标题",
  "status": "ARCHIVED",
  "form_metadata": null,
  "form_args": {
      "finish_at": "2024-05-13 10:00:50.261",
      "created_at": "2024-05-13 10:00:29.458",
      "curr_form_data": "",
      "curr_form_version": "",
      "create_by": "冯勤 WX1112091",
      "flow_trans_id": "2b9ec9d12a774660a09e428d46d1ef89",
      "inst_status": "ARCHIVED",
      "curr_node_id": "",
      "agentResult": "",
      "modified_by": "冯勤 WX1112091",
      "aipp_instance_name": "无标题",
      "progress": "0",
      "curr_form_id": "",
      "modified_at": ""
  },
  "start_time": "2024-05-13 10:00:29.458",
  "end_time": "2024-05-13 10:00:50.261",
  "instance_log": [
      {
          "logId": 15758,
          "aippId": "dd89a95315b646afac7420799a5b15d2",
          "version": "1.0.0-cfd919",
          "aippType": "PREVIEW",
          "instanceId": "c8a9e655cfbb47c0aa6925b498078a1c",
          "logData": "{\"msg\": \"大熊猫的说明文档\", \"form_id\": null, \"form_args\": null, \"form_version\": null}",
          "logType": "QUESTION",
          "createAt": "2024-05-13 10:00:29",
          "createUserAccount": "fWX1112091",
          "path": "/c8a9e655cfbb47c0aa6925b498078a1c",
          "reserve": null
      },
      {
          "logId": 15760,
          "aippId": "dd89a95315b646afac7420799a5b15d2",
          "version": "1.0.0-cfd919",
          "aippType": "PREVIEW",
          "instanceId": "c8a9e655cfbb47c0aa6925b498078a1c",
          "logData": "{\"msg\": \"```markdown\\n# 大熊猫\\n\\n## 简介\\n\\n大熊猫（学名：Ailuropoda melanoleuca），又称猫熊、竹熊、银狗、洞尕、食铁兽等，是一种以竹子为食的哺乳动物，属于食肉目、熊科。大熊猫是中国特有的物种，主要分布在中国四川、陕西和甘肃的山区。\\n\\n## 外形特征\\n\\n大熊猫体型肥硕似熊，头大圆脸，眼睛周围、耳朵、四肢以及肩部呈黑色，其余部分为白色。它们的尾巴相对较短，通常为10-20厘米。成年大熊猫的体重通常在80-125千克之间，肩高约70-90厘米，体长120-190厘米。\\n\\n## 生活习性\\n\\n大熊猫主要栖息在海拔1000-3000米的山地森林中，善于攀树和游泳。它们以竹子为主要食物来源，约占其饮食的99%，偶尔也会捕食小型哺乳动物和鸟类。大熊猫的活动范围广泛，但通常在一定区域内活动。\\n\\n## 繁殖\\n\\n大熊猫的繁殖率相对较低，雌性大熊猫每年只在春季排卵一次，且排卵期非常短，只有1-3天。因此，大熊猫的繁殖难度较大。大熊猫的幼崽出生时体重非常轻，通常只有100-200克，需要在母熊猫的照顾下成长。\\n\\n## 保护状况\\n\\n由于栖息地丧失和低繁殖率等原因，大熊猫曾被列为濒危物种。然而，经过多年的保护工作，大熊猫的种群数量有所增加，其保护状况已升级为易危。尽管如此，大熊猫的保护工作仍然需要继续进行。\\n\\n## 人类与大熊猫的关系\\n\\n大熊猫因其可爱的外表和温顺的性格而受到人们的喜爱。在中国，大熊猫被视为国宝，并被广泛用于国际外交和文化交流活动中。同时，大熊猫也是世界自然基金会的会徽动物。\\n\\n```\\n\\n```jsx\\n <div className='graph-detai'> \\n\\n```\", \"form_id\": null, \"form_args\": null, \"form_version\": null}",
          // "logData": "{\"msg\": \"c****__****d8222222222********88888888*********\", \"form_id\": null, \"form_args\": null, \"form_version\": null}",
          "logType": "MSG",
          "createAt": "2024-05-13 10:00:50",
          "createUserAccount": "fWX1112091",
          "path": "/c8a9e655cfbb47c0aa6925b498078a1c",
          "reserve": null
      }
  ]
}
export const formMock = {
  // formType: 'file',
  // formType: 'interview',
  formType: 'report',
  formMap: {
    value: '666666666'
  },
  reportData: {
    "reportResult": [
        {
          "answer": {
            "chartType": [
                "TABLE",
                "MIX_LINE_BAR"
            ],
            "chartData": [
                "{\"columns\":[\"重点国\",\"2022年12月\",\"2023年12月\",\"同比增长(%)\"],\"rows\":[[\"香港\",\"42.1\",\"57.4\",\"36.3%\"],[\"德国\",\"40.5\",\"46.4\",\"14.7%\"],[\"土耳其\",\"21.3\",\"43.0\",\"101.8%\"],[\"新加坡\",\"30.0\",\"40.0\",\"33.5%\"],[\"巴西\",\"26.8\",\"38.3\",\"42.5%\"],[\"南非\",\"31.8\",\"35.6\",\"11.8%\"],[\"法国\",\"23.5\",\"27.7\",\"17.9%\"],[\"西班牙\",\"11.6\",\"24.4\",\"109.8%\"],[\"尼日利亚\",\"10.1\",\"24.0\",\"137.3%\"],[\"意大利\",\"8.4\",\"22.6\",\"169.5%\"],[\"沙特\",\"20.5\",\"22.3\",\"8.5%\"],[\"阿联酋\",\"14.6\",\"20.6\",\"41.3%\"],[\"墨西哥\",\"13.5\",\"19.8\",\"45.9%\"],[\"印度尼西亚\",\"8.2\",\"16.3\",\"99.1%\"],[\"北欧\",\"6.5\",\"13.0\",\"101.2%\"],[\"瑞士\",\"12.9\",\"12.7\",\"-1.7%\"],[\"西欧多国管理部\",\"9.6\",\"12.4\",\"29.4%\"],[\"菲律宾\",\"3.9\",\"10.5\",\"169.7%\"],[\"马来西亚\",\"4.6\",\"7.5\",\"63.1%\"],[\"泰国\",\"5.5\",\"7.1\",\"29.2%\"],[\"韩国\",\"10.4\",\"6.8\",\"-34.3%\"],[\"日本\",\"4.7\",\"3.3\",\"-28.8%\"],[\"汇总\",\"361.0\",\"511.6\",\"41.7%\"]]}",
                "{\"bar\":[{\"data\":[\"42.1\",\"40.5\",\"21.3\",\"30.0\",\"26.8\",\"31.8\",\"23.5\",\"11.6\",\"10.1\",\"8.4\",\"20.5\",\"14.6\",\"13.5\",\"8.2\",\"6.5\",\"12.9\",\"9.6\",\"3.9\",\"4.6\",\"5.5\",\"10.4\",\"4.7\",\"361.0\"],\"title\":\"2022年12月\"},{\"data\":[\"57.4\",\"46.4\",\"43.0\",\"40.0\",\"38.3\",\"35.6\",\"27.7\",\"24.4\",\"24.0\",\"22.6\",\"22.3\",\"20.6\",\"19.8\",\"16.3\",\"13.0\",\"12.7\",\"12.4\",\"10.5\",\"7.5\",\"7.1\",\"6.8\",\"3.3\",\"511.6\"],\"title\":\"2023年12月\"}],\"line\":[{\"data\":[\"36.3%\",\"14.7%\",\"101.8%\",\"33.5%\",\"42.5%\",\"11.8%\",\"17.9%\",\"109.8%\",\"137.3%\",\"169.5%\",\"8.5%\",\"41.3%\",\"45.9%\",\"99.1%\",\"101.2%\",\"-1.7%\",\"29.4%\",\"169.7%\",\"63.1%\",\"29.2%\",\"-34.3%\",\"-28.8%\",\"41.7%\"],\"title\":\"同比增长(%)\"}],\"labels\":[\"香港\",\"德国\",\"土耳其\",\"新加坡\",\"巴西\",\"南非\",\"法国\",\"西班牙\",\"尼日利亚\",\"意大利\",\"沙特\",\"阿联酋\",\"墨西哥\",\"印度尼西亚\",\"北欧\",\"瑞士\",\"西欧多国管理部\",\"菲律宾\",\"马来西亚\",\"泰国\",\"韩国\",\"日本\",\"汇总\"]}"
            ],
            "chartTitle": [
                "口径：经营双算，单位：M$，指标：净销售收入",
                "口径：经营双算，单位：M$，指标：净销售收入"
            ],
            "chartAnswer": [
                "2023年12月，存储企业海外分重点国的收入和同比，结果如下：",
                null
            ],
            "chartSummary": [
                "2023年12月，存储企业海外分重点国的收入和同比，结果如下：<br> 1. 香港：收入为42.1，同比增长36.3%；<br>2. 德国：收入为40.5，同比增长14.7%；<br>3. 土耳其：收入为21.3，同比增长101.8%；<br>4. 新加坡：收入为30.0，同比增长33.5%；<br>5. 巴西：收入为26.8，同比增长42.5%；<br>6. 南非：收入为31.8，同比增长11.8%；<br>7. 法国：收入为23.5，同比增长17.9%；<br>8. 西班牙：收入为11.6，同比增长109.8%；<br>9. 尼日利亚：收入为10.1，同比增长137.3%；<br>10. 意大利：收入为8.4，同比增长169.5%；<br>11. 沙特：收入为20.5，同比增长8.5%；<br>12. 阿联酋：收入为14.6，同比增长41.3%；<br>13. 墨西哥：收入为13.5，同比增长45.9%；<br>14. 印度尼西亚：收入为8.2，同比增长99.1%；<br>15. 北欧：收入为6.5，同比增长101.2%；<br>16. 瑞士：收入为12.9，同比增长-1.7%；<br>17. 西欧多国管理部：收入为9.6，同比增长29.4%；<br>18. 菲律宾：收入为3.9，同比增长169.7%；<br>19. 马来西亚：收入为4.6，同比增长63.1%；<br>20. 泰国：收入为5.5，同比增长29.2%；<br>21. 韩国：收入为10.4，同比增长-34.3%；<br>22. 日本：收入为4.7，同比增长-28.8%；<br>23. 汇总：收入为361.0，同比增长41.7%。",
                "这是关于2022年12月和2023年12月不同国家和地区经济增长的数据。其中，香港、德国、土耳其、新加坡、巴西、南非、法国、西班牙、尼日利亚、意大利、沙特、阿联酋、墨西哥、印度尼西亚、北欧、瑞士、西欧多国管理部、菲律宾、马来西亚、泰国、韩国和日本等国家和地区的经济增长数据分别在两个时间段内有所波动。同时，这些数据还显示了同比增长的百分比。"
            ]
          },
          "question": {
            "createUser": "00816135",
            "appId": "201",
            "conversationId": 0,
            "query": "2023年存储企业海外分重点国的收入和同比是多少？????"
          }
        }
    ]
  }
}
export const chatMock2 = {
  "answer": "近两年园区国内各个行业的收入占比，结果如下： ",
  "chartAnswer": [
      "近两年园区国内各个行业的收入占比，结果如下：",
      " "
  ],
  "chartData": [
      "{\"columns\":[\"国内行业\",\"2022年1-12月\",\"2022年1-12月占比(%)\",\"2023年1-12月\",\"2023年1-12月占比(%)\"],\"rows\":[[\"数字政府\",\"29.6\",\"43.0%\",\"31.2\",\"34.6%\"],[\"智能制造\",\"13.0\",\"18.9%\",\"30.2\",\"33.5%\"],[\"教育医疗\",\"7.0\",\"10.1%\",\"10.2\",\"11.3%\"],[\"大企业\",\"12.4\",\"18.0%\",\"7.9\",\"8.8%\"],[\"电力\",\"1.9\",\"2.7%\",\"7.5\",\"8.4%\"],[\"金融\",\"1.3\",\"1.9%\",\"1.4\",\"1.6%\"],[\"油气\",\"3.1\",\"4.5%\",\"0.7\",\"0.7%\"],[\"安平\",\"1.7\",\"2.4%\",\"0.4\",\"0.5%\"],[\"媒资\",\"0.0\",\"0.0%\",\"0.0\",\"0.0%\"],[\"分销\",\"0.0\",\"0.0%\",\"0.0\",\"0.0%\"]]}",
      "{\"stack\":[{\"data\":[\"29.6\",\"31.2\"],\"title\":\"数字政府\"},{\"data\":[\"13.0\",\"30.2\"],\"title\":\"智能制造\"},{\"data\":[\"7.0\",\"10.2\"],\"title\":\"教育医疗\"},{\"data\":[\"12.4\",\"7.9\"],\"title\":\"大企业\"},{\"data\":[\"1.9\",\"7.5\"],\"title\":\"电力\"},{\"data\":[\"1.3\",\"1.4\"],\"title\":\"金融\"},{\"data\":[\"3.1\",\"0.7\"],\"title\":\"油气\"},{\"data\":[\"1.7\",\"0.4\"],\"title\":\"安平\"},{\"data\":[\"0.0\",\"0.0\"],\"title\":\"媒资\"},{\"data\":[\"0.0\",\"0.0\"],\"title\":\"分销\"}],\"line\":[{\"data\":[\"70.0\",\"89.5\"],\"title\":\"总收入\"}],\"labels\":[\"2022年1-12月\",\"2023年1-12月\"]}"
  ],
  "chartTitle": [
      "口径：经营双算，单位：M￥，指标：净销售收入",
      "口径：经营双算，单位：M￥，指标：净销售收入"
  ],
  "chartType": [
      "TABLE",
      "BAR_STACK"
  ]
}
export const inspirationMock = [
  {
      "title": "产品线",
      "id": "11",
      "parent": "root:11",
      "disable": null,
      "children": [
          {
              "title": "数存",
              "id": "111",
              "parent": "11:111",
              "disable": null,
              "children": [
                  {
                      "title": "数字化工具",
                      "id": "1111",
                      "parent": "111:1111",
                      "disable": null,
                      "children": []
                  }
              ]
          }
      ]
  },
  {
      "title": "BG",
      "id": "12",
      "parent": "root:12",
      "disable": null,
      "children": [
          {
              "title": "运营商",
              "id": "121",
              "parent": "12:121",
              "disable": null,
              "children": [
                  {
                      "title": "数字化工具",
                      "id": "1211",
                      "parent": "121:1211",
                      "disable": null,
                      "children": []
                  }
              ]
          }
      ]
  },
  {
      "title": "区域",
      "id": "13",
      "parent": "root:13",
      "disable": null,
      "children": [
          {
              "title": "中国区",
              "id": "131",
              "parent": "13:131",
              "disable": null,
              "children": [
                  {
                      "title": "数字化工具",
                      "id": "1311",
                      "parent": "131:1311",
                      "disable": null,
                      "children": []
                  }
              ]
          }
      ]
  }
]